html/karabiner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 06:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>goku (karabiner) config</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/">
<h2>Ketan's Digital Laboratory &#129514;</h2>
</a>
</div>
<div id="content" class="content">
<h1 class="title">goku (karabiner) config</h1>
<p>
Created by Ketan Agrawal<br />
</p>



<p>
inspiration taken from these goku configs:<br />
</p>
<ul class="org-ul">
<li><a href="https://github.com/yqrashawn/yqdotfiles/blob/master/.config/karabiner.edn">yqrashawn</a><br /></li>
<li><a href="https://github.com/nikitavoloboev/dotfiles/blob/master/karabiner/karabiner.edn">nikitavoloboev</a><br /></li>
<li><a href="https://gist.github.com/kaushikgopal/ff7a92bbc887e59699c804b59074a126">kaushikgopal</a><br /></li>
</ul>

<p>
This is my literate config for <a href="https://github.com/yqrashawn/GokuRakuJoudo">goku</a>. It makes it easy to define keyboard shortcuts in a succinct and powerful way.<br />
</p>

<div id="outline-container-orge629072" class="outline-2">
<h2 id="orge629072">Guide</h2>
<div class="outline-text-2" id="text-orge629072">
<p>
For more info on configuring Goku, see the <a href="https://github.com/yqrashawn/GokuRakuJoudo/blob/master/tutorial.md">tutorial</a>.<br />
Guide lifted from <a href="https://gist.github.com/kaushikgopal/ff7a92bbc887e59699c804b59074a126">kaushikgopal</a>. To understand better how modifiers work in karabiner, see the karabiner definition of mandatory and optional: <a href="https://karabiner-elements.pqrs.org/docs/json/complex-modifications-manipulator-definition/from/modifiers/#frommodifiersoptional%20%20%20">karabiner modifiers documentation</a><br />
need to prefix C T O S F with ! or #<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modifier</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">!</td>
<td class="org-left">mandatory (w/o modifier changes behavior)</td>
</tr>

<tr>
<td class="org-left">#</td>
<td class="org-left">optional (but at least one necessary)</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">left command</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">left control</td>
</tr>

<tr>
<td class="org-left">O</td>
<td class="org-left">left option</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">left shift</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">fn</td>
</tr>

<tr>
<td class="org-left">Q</td>
<td class="org-left">right command</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">right control</td>
</tr>

<tr>
<td class="org-left">E</td>
<td class="org-left">right option</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">right shift</td>
</tr>

<tr>
<td class="org-left">##</td>
<td class="org-left">optional any</td>
</tr>

<tr>
<td class="org-left">!!</td>
<td class="org-left">command + control + optional + shift (hyper)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbc30432" class="outline-2">
<h2 id="orgbc30432">Profiles</h2>
<div class="outline-text-2" id="text-orgbc30432">
<div class="org-src-container">
<pre class="src src-clojure">{<span class="org-comment-delimiter">;;</span><span class="org-comment">beginning bracket for whole data structure -- don't delete!</span>

 <span class="org-clojure-keyword">:profiles</span> {
            <span class="org-clojure-keyword">:Ketan</span> {
                    <span class="org-clojure-keyword">:default</span> <span class="org-constant">true</span>
                    <span class="org-clojure-keyword">:sim</span>     500    <span class="org-comment-delimiter">;; </span><span class="org-comment">simultaneous_threshold_milliseconds (def: 50)</span>
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">keys need to be pressed within this threshold to be considered simultaneous</span>
                    <span class="org-clojure-keyword">:delay</span>   80    <span class="org-comment-delimiter">;; </span><span class="org-comment">to_delayed_action_delay_milliseconds (def: 500)</span>
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">basically it means time after which the key press is count delayed</span>
                    <span class="org-clojure-keyword">:alone</span>   500      <span class="org-comment-delimiter">;; </span><span class="org-comment">to_if_alone_timeout_milliseconds (def: 1000)</span>
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">hold for 995s and single tap registered; hold for 1005s and seen as modifier</span>
                    <span class="org-clojure-keyword">:held</span>    1000   <span class="org-comment-delimiter">;; </span><span class="org-comment">to_if_held_down_threshold_milliseconds (def: 500)</span>
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">key is fired twice when 500 ms is elapsed (otherwise seen as a hold command)</span>
                    }
            } <span class="org-comment-delimiter">;; </span><span class="org-comment">profiles</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org48f5920" class="outline-2">
<h2 id="org48f5920">Templates</h2>
<div class="outline-text-2" id="text-org48f5920">
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:templates</span> {
            <span class="org-clojure-keyword">:km</span> <span class="org-string">"osascript -e 'tell application </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">Keyboard Maestro Engine</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> to do script </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> with parameter </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">'"</span>
            <span class="org-comment-delimiter">;; </span><span class="org-comment">Removed the quotes around %s because it makes it not able to open files too</span>
            <span class="org-clojure-keyword">:open</span> <span class="org-string">"open '%s'"</span>
            <span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"osascript ~/.dotfiles/open_url_smart.scpt '%s'"</span>
            <span class="org-clojure-keyword">:openwith</span> <span class="org-string">"open -a '%s' '%s'"</span>
            <span class="org-clojure-keyword">:openhide</span> <span class="org-string">"open '%s' -gj"</span>
            <span class="org-clojure-keyword">:withsecret</span> <span class="org-string">"source ~/.dotfiles/.secrets &amp;&amp; %s"</span>
            <span class="org-clojure-keyword">:withsecretsmarturl</span> <span class="org-string">"source ~/.dotfiles/.secrets &amp;&amp; osascript ~/.dotfiles/open_url_smart.scpt %s"</span>
            <span class="org-clojure-keyword">:alfred</span> <span class="org-string">"osascript -e 'tell application </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">Alfred 4</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> to run trigger </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> in workflow </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> with argument </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">'"</span>
            <span class="org-clojure-keyword">:wallpaper</span> <span class="org-string">"osascript -e 'tell application </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">Finder</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string"> to set desktop picture to POSIX file </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">'"</span>
            <span class="org-clojure-keyword">:elisp</span> <span class="org-string">"/usr/local/bin/emacsclient --eval '(progn (select-frame-set-input-focus (selected-frame))%s)'"</span>
            } <span class="org-comment-delimiter">;; </span><span class="org-comment">templates</span>

</pre>
</div>
</div>
</div>
