org/karabiner.org
* Layers & Simlayers
#+begin_src clojure
:layers {

         :tab-mode {:key :tab
                    :afterup [{:set ["yabai-move-mode" 0]}
                              {:set ["yabai-focus-mode" 0]}
                              {:set ["yabai-display-mode" 0]}
                              {:set ["chrome-movement-mode" 0]}
                              {:set ["chrome-rearrange-tab-mode" 0]}]}

         :yabai-move-mode {:key :w :condi :tab-mode}
         :yabai-focus-mode {:key :f :condi :tab-mode}
         :yabai-display-mode {:key :d :condi :tab-mode}
         :chrome-movement-mode {:key :t :condi :tab-mode} ;;TODO make this work
         :chrome-history-mode {:key :g :condi :tab-mode} ;;TODO make this work
         :chrome-rearrange-tab-mode {:key :r :condi :tab-mode}
         :vim-mode {:key :z}
         :tilde-mode {:key :grave_accent_and_tilde}
}

:simlayers {
        :slash-mode {:key :slash}
        :q-key-mode {:key :q}
        :x-key-mode {:key :x}
        :jupyter-mode {:key :j}
        :o-key-mode {:key :o}
        :comma-mode {:key :comma}
        :wallpaper-mode {:key :w}
}

#+end_src

* Main
** begin main
#+begin_src clojure
:main [{
        :des "see karabiner.org for documentation.",
        :rules [
#+end_src
** right cmd/option => previous app
Switch to the previous application with right command/option -- right command hides the current app, right option doesn't.
#+begin_src clojure
[:right_command :right_command nil {:alone [:km "Previous Application" "hide"]}]
[:right_option :right_option nil {:alone [:km "Previous Application"]}]
#+end_src
** caps lock alone = escape, with other keys = ctrl
#+begin_src clojure
[:##caps_lock :left_control nil {:alone :escape}]
#+end_src
** yabai-move-mode (tab + w + {hjkl})
Move the current window directionally in the yabai tiling setup.
#+begin_src clojure
:yabai-move-mode
[:h "/usr/local/bin/yabai -m window --warp west"]
[:j "/usr/local/bin/yabai -m window --warp south"]
[:k "/usr/local/bin/yabai -m window --warp north"]
[:l "/usr/local/bin/yabai -m window --warp east"]
[:b "/usr/local/bin/yabai -m space --balance"]
[:0 "/usr/local/bin/yabai -m window --opacity 0.0"]
[:1 "/usr/local/bin/yabai -m window --opacity 0.1"]
[:2 "/usr/local/bin/yabai -m window --opacity 0.2"]
[:3 "/usr/local/bin/yabai -m window --opacity 0.3"]
[:4 "/usr/local/bin/yabai -m window --opacity 0.4"]
[:5 "/usr/local/bin/yabai -m window --opacity 0.5"]
[:6 "/usr/local/bin/yabai -m window --opacity 0.6"]
[:7 "/usr/local/bin/yabai -m window --opacity 0.7"]
[:8 "/usr/local/bin/yabai -m window --opacity 0.8"]
[:9 "/usr/local/bin/yabai -m window --opacity 0.9"]
[:grave_accent_and_tilde "/usr/local/bin/yabai -m window --opacity 1.0"]
[:s "/usr/local/bin/yabai -m window --toggle split"]
#+end_src

** yabai-focus-mode (tab + f + {hjkl})
Move focus to the left/top/bottom/right of the current window.
#+begin_src clojure
:yabai-focus-mode
[:g "/usr/local/bin/yabai -m space --focus prev"]
[:h "/usr/local/bin/yabai -m window --focus west"]
[:j "/usr/local/bin/yabai -m window --focus south"]
[:k "/usr/local/bin/yabai -m window --focus north"]
[:l "/usr/local/bin/yabai -m window --focus east"]
[:semicolon "/usr/local/bin/yabai -m space --focus next"]
#+end_src

** yabai-display-mode (tab + d + {hjkl})
#+begin_src clojure
:yabai-display-mode
[:h "/usr/local/bin/yabai -m display --focus prev"]
[:j "/usr/local/bin/yabai -m window --display prev && /usr/local/bin/yabai -m display --focus prev"]
[:k "/usr/local/bin/yabai -m window --display next && /usr/local/bin/yabai -m display --focus next"]
[:l "/usr/local/bin/yabai -m display --focus next"]
#+end_src

** chrome-history-mode (tab + g + {hl})
Move backward/forward in Chrome history.
#+begin_src clojure
:chrome-history-mode
[:h :!Copen_bracket]
[:l :!Cclose_bracket]
#+end_src
** chrome-movement-mode (tab + t + {hl})
Move to the tab left/right of the current tab.
#+begin_src clojure
:chrome-movement-mode
[:h :!TStab]
[:l :!Ttab]
#+end_src
