html/karabiner.html

<div id="outline-container-org7b97e31" class="outline-2">
<h2 id="org7b97e31">Layers &amp; Simlayers</h2>
<div class="outline-text-2" id="text-org7b97e31">
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:layers</span> {

         <span class="org-clojure-keyword">:tab-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:tab</span>
                    <span class="org-clojure-keyword">:afterup</span> [{<span class="org-clojure-keyword">:set</span> [<span class="org-string">"yabai-move-mode"</span> 0]}
                              {<span class="org-clojure-keyword">:set</span> [<span class="org-string">"yabai-focus-mode"</span> 0]}
                              {<span class="org-clojure-keyword">:set</span> [<span class="org-string">"yabai-display-mode"</span> 0]}
                              {<span class="org-clojure-keyword">:set</span> [<span class="org-string">"chrome-movement-mode"</span> 0]}
                              {<span class="org-clojure-keyword">:set</span> [<span class="org-string">"chrome-rearrange-tab-mode"</span> 0]}]}

         <span class="org-clojure-keyword">:yabai-move-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:w</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>}
         <span class="org-clojure-keyword">:yabai-focus-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:f</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>}
         <span class="org-clojure-keyword">:yabai-display-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:d</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>}
         <span class="org-clojure-keyword">:chrome-movement-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:t</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>} <span class="org-comment-delimiter">;;</span><span class="org-comment">TODO make this work</span>
         <span class="org-clojure-keyword">:chrome-history-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:g</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>} <span class="org-comment-delimiter">;;</span><span class="org-comment">TODO make this work</span>
         <span class="org-clojure-keyword">:chrome-rearrange-tab-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:r</span> <span class="org-clojure-keyword">:condi</span> <span class="org-clojure-keyword">:tab-mode</span>}
         <span class="org-clojure-keyword">:vim-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:z</span>}
         <span class="org-clojure-keyword">:tilde-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:grave_accent_and_tilde</span>}
}

<span class="org-clojure-keyword">:simlayers</span> {
        <span class="org-clojure-keyword">:slash-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:slash</span>}
        <span class="org-clojure-keyword">:q-key-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:q</span>}
        <span class="org-clojure-keyword">:x-key-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:x</span>}
        <span class="org-clojure-keyword">:jupyter-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:j</span>}
        <span class="org-clojure-keyword">:o-key-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:o</span>}
        <span class="org-clojure-keyword">:comma-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:comma</span>}
        <span class="org-clojure-keyword">:wallpaper-mode</span> {<span class="org-clojure-keyword">:key</span> <span class="org-clojure-keyword">:w</span>}
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org1dbb7ce" class="outline-2">
<h2 id="org1dbb7ce">Main</h2>
<div class="outline-text-2" id="text-org1dbb7ce">
</div>
<div id="outline-container-org3a4beb7" class="outline-3">
<h3 id="org3a4beb7">begin main</h3>
<div class="outline-text-3" id="text-org3a4beb7">
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:main</span> [{
        <span class="org-clojure-keyword">:des</span> <span class="org-string">"see karabiner.org for documentation."</span>,
        <span class="org-clojure-keyword">:rules</span> [
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfedff5d" class="outline-3">
<h3 id="orgfedff5d">right cmd/option =&gt; previous app</h3>
<div class="outline-text-3" id="text-orgfedff5d">
<p>
Switch to the previous application with right command/option &#x2013; right command hides the current app, right option doesn't.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure">[<span class="org-clojure-keyword">:right_command</span> <span class="org-clojure-keyword">:right_command</span> <span class="org-constant">nil</span> {<span class="org-clojure-keyword">:alone</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Previous Application"</span> <span class="org-string">"hide"</span>]}]
[<span class="org-clojure-keyword">:right_option</span> <span class="org-clojure-keyword">:right_option</span> <span class="org-constant">nil</span> {<span class="org-clojure-keyword">:alone</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Previous Application"</span>]}]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb15d61a" class="outline-3">
<h3 id="orgb15d61a">caps lock alone = escape, with other keys = ctrl</h3>
<div class="outline-text-3" id="text-orgb15d61a">
<div class="org-src-container">
<pre class="src src-clojure">[<span class="org-clojure-keyword">:##caps_lock</span> <span class="org-clojure-keyword">:left_control</span> <span class="org-constant">nil</span> {<span class="org-clojure-keyword">:alone</span> <span class="org-clojure-keyword">:escape</span>}]
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a3fab0" class="outline-3">
<h3 id="org8a3fab0">yabai-move-mode (tab + w + {hjkl})</h3>
<div class="outline-text-3" id="text-org8a3fab0">
<p>
Move the current window directionally in the yabai tiling setup.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:yabai-move-mode</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-string">"/usr/local/bin/yabai -m window --warp west"</span>]
[<span class="org-clojure-keyword">:j</span> <span class="org-string">"/usr/local/bin/yabai -m window --warp south"</span>]
[<span class="org-clojure-keyword">:k</span> <span class="org-string">"/usr/local/bin/yabai -m window --warp north"</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-string">"/usr/local/bin/yabai -m window --warp east"</span>]
[<span class="org-clojure-keyword">:b</span> <span class="org-string">"/usr/local/bin/yabai -m space --balance"</span>]
[:0 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.0"</span>]
[:1 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.1"</span>]
[:2 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.2"</span>]
[:3 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.3"</span>]
[:4 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.4"</span>]
[:5 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.5"</span>]
[:6 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.6"</span>]
[:7 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.7"</span>]
[:8 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.8"</span>]
[:9 <span class="org-string">"/usr/local/bin/yabai -m window --opacity 0.9"</span>]
[<span class="org-clojure-keyword">:grave_accent_and_tilde</span> <span class="org-string">"/usr/local/bin/yabai -m window --opacity 1.0"</span>]
[<span class="org-clojure-keyword">:s</span> <span class="org-string">"/usr/local/bin/yabai -m window --toggle split"</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf97e9a1" class="outline-3">
<h3 id="orgf97e9a1">yabai-focus-mode (tab + f + {hjkl})</h3>
<div class="outline-text-3" id="text-orgf97e9a1">
<p>
Move focus to the left/top/bottom/right of the current window.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:yabai-focus-mode</span>
[<span class="org-clojure-keyword">:g</span> <span class="org-string">"/usr/local/bin/yabai -m space --focus prev"</span>]
[<span class="org-clojure-keyword">:h</span> <span class="org-string">"/usr/local/bin/yabai -m window --focus west"</span>]
[<span class="org-clojure-keyword">:j</span> <span class="org-string">"/usr/local/bin/yabai -m window --focus south"</span>]
[<span class="org-clojure-keyword">:k</span> <span class="org-string">"/usr/local/bin/yabai -m window --focus north"</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-string">"/usr/local/bin/yabai -m window --focus east"</span>]
[<span class="org-clojure-keyword">:semicolon</span> <span class="org-string">"/usr/local/bin/yabai -m space --focus next"</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-org23538eb" class="outline-3">
<h3 id="org23538eb">yabai-display-mode (tab + d + {hjkl})</h3>
<div class="outline-text-3" id="text-org23538eb">
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:yabai-display-mode</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-string">"/usr/local/bin/yabai -m display --focus prev"</span>]
[<span class="org-clojure-keyword">:j</span> <span class="org-string">"/usr/local/bin/yabai -m window --display prev &amp;&amp; /usr/local/bin/yabai -m display --focus prev"</span>]
[<span class="org-clojure-keyword">:k</span> <span class="org-string">"/usr/local/bin/yabai -m window --display next &amp;&amp; /usr/local/bin/yabai -m display --focus next"</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-string">"/usr/local/bin/yabai -m display --focus next"</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1e1072" class="outline-3">
<h3 id="orgc1e1072">chrome-history-mode (tab + g + {hl})</h3>
<div class="outline-text-3" id="text-orgc1e1072">
<p>
Move backward/forward in Chrome history.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:chrome-history-mode</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-clojure-keyword">:!Copen_bracket</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-clojure-keyword">:!Cclose_bracket</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-orge70cf9c" class="outline-3">
<h3 id="orge70cf9c">chrome-movement-mode (tab + t + {hl})</h3>
<div class="outline-text-3" id="text-orge70cf9c">
<p>
Move to the tab left/right of the current tab.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:chrome-movement-mode</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-clojure-keyword">:!TStab</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-clojure-keyword">:!Ttab</span>]
</pre>
</div>
</div>
</div>
