html/karabiner.html
<div id="outline-container-org2d3dd45" class="outline-3">
<h3 id="org2d3dd45">chrome-rearrange-tab-mode (tab + r + {hl})</h3>
<div class="outline-text-3" id="text-org2d3dd45">
<p>
Move current tab left/right. Need <a href="https://chrome.google.com/webstore/detail/rearrange-tabs/ccnnhhnmpoffieppjjkhdakcoejcpbga">this Chrome extension</a> for this to work.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:chrome-rearrange-tab-mode</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-clojure-keyword">:!TSleft_arrow</span>]
[<span class="org-clojure-keyword">:l</span> <span class="org-clojure-keyword">:!TSright_arrow</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-org5842188" class="outline-3">
<h3 id="org5842188">tab-mode (tab)</h3>
<div class="outline-text-3" id="text-org5842188">
<p>
Mostly for opening apps, and some other convenient shortcuts like toggling dark mode and emojis.<br />
</p>

<p>
Toggle system dark mode, as well as the emacs theme. (See <a href="https://github.com/ketan0/dotfiles/blob/master/doom.d/config.el">ketan0/responsive-theme</a> for details)<br />
</p>
<div class="org-src-container">
<pre class="src src-apples"><span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"System Events"</span>
    <span class="org-apples-statements">tell</span> appearance <span class="org-apples-standard-folders">preferences</span>
        <span class="org-apples-commands">set</span> dark mode <span class="org-apples-reserved-words">to</span> <span class="org-apples-operators">not</span> dark mode
        <span class="org-apples-commands">do shell script</span> <span class="org-string">"/usr/local/bin/emacsclient --eval '(load-theme (ketan0/responsive-theme) t)'"</span>
    <span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:tab-mode</span>
[<span class="org-clojure-keyword">:spacebar</span> <span class="org-clojure-keyword">:!CTspacebar</span>] <span class="org-comment-delimiter">;; </span><span class="org-comment">open emoji picker</span>
[<span class="org-clojure-keyword">:return_or_enter</span>  <span class="org-string">"/usr/local/bin/yabai -m window --toggle float"</span>]
[<span class="org-clojure-keyword">:comma</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Messenger"</span> <span class="org-string">"hide"</span>]]
[:3 <span class="org-string">"osascript ~/.dotfiles/toggle_dark_mode.scpt"</span>]
[:4 [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Finder"</span>]]
[<span class="org-clojure-keyword">:a</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Safari"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:x</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Chrome"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:c</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Safari"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:k</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Keyboard Maestro"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:e</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Emacs"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:i</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open iTerm"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:m</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Messages"</span> <span class="org-string">"hide"</span>]]
[<span class="org-clojure-keyword">:s</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Spotify"</span> <span class="org-string">"hide"</span>]]
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:n [:km "Open Neo4j" "hide"]]</span>
[<span class="org-clojure-keyword">:v</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Zoom"</span> <span class="org-string">"hide"</span>]]
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:q [:km "Open Qutebrowser"]]</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:x [:km "Open Xcode"]]</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:w [:km "Open Word"]]</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgab3ef69" class="outline-3">
<h3 id="orgab3ef69">q-key-mode (q)</h3>
<div class="outline-text-3" id="text-orgab3ef69">
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:q-key-mode</span>
[<span class="org-clojure-keyword">:grave_accent_and_tilde</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Stickies"</span>]]
[<span class="org-clojure-keyword">:a</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Safari"</span>]]
[<span class="org-clojure-keyword">:x</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Chrome"</span>]]
[<span class="org-clojure-keyword">:s</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Spotify"</span>]]
[<span class="org-clojure-keyword">:c</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Safari"</span>]]
[<span class="org-clojure-keyword">:k</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Keyboard Maestro"</span>]]
[<span class="org-clojure-keyword">:e</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Emacs"</span>]]
[<span class="org-clojure-keyword">:i</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open iTerm"</span>]]
[<span class="org-clojure-keyword">:m</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Messages"</span>]]
[<span class="org-clojure-keyword">:comma</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Messenger"</span>]]
[<span class="org-clojure-keyword">:n</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Neo4j"</span>]]
[<span class="org-clojure-keyword">:v</span> [<span class="org-clojure-keyword">:km</span> <span class="org-string">"Open Zoom"</span>]]
</pre>
</div>
</div>
</div>
<div id="outline-container-org07103d1" class="outline-3">
<h3 id="org07103d1">x-key-mode (x)</h3>
<div class="outline-text-3" id="text-org07103d1">
<div class="org-src-container">
<pre class="src src-apples"><span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Google Chrome"</span>
    execute <span class="org-apples-reserved-words">front</span> window<span class="org-apples-reserved-words">'s</span> active tab javascript <span class="org-string">"javascript:location.href = 'org-protocol://roam-ref?template=r&amp;ref=' + encodeURIComponent(location.href) + '&amp;title=' + encodeURIComponent(document.title)"</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:x-key-mode</span>
[<span class="org-clojure-keyword">:a</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(ketan0/switch-to-main-agenda)"</span>]]
[<span class="org-clojure-keyword">:s</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(+org-capture/open-frame nil </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">s</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">)"</span>]]
[<span class="org-clojure-keyword">:t</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(+org-capture/open-frame nil </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">t</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">)"</span>]]
[<span class="org-clojure-keyword">:d</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(+org-capture/open-frame nil </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">d</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">)"</span>]]
[<span class="org-clojure-keyword">:i</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(+org-capture/open-frame nil </span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">i</span><span class="org-string"><span class="org-bold">\"</span></span><span class="org-string">)"</span>]]
[<span class="org-clojure-keyword">:g</span> <span class="org-string">"osascript ~/.dotfiles/org_roam_capture.scpt"</span>] <span class="org-comment-delimiter">;; </span><span class="org-comment">create new org-roam note</span>
[<span class="org-clojure-keyword">:spacebar</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(+org-capture/open-frame)"</span>]]
[<span class="org-clojure-keyword">:r</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(org-roam-node-random)"</span>]]
[<span class="org-clojure-keyword">:j</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(org-journal-new-entry nil)"</span>]]
</pre>
</div>
</div>
</div>
<div id="outline-container-org555bbb1" class="outline-3">
<h3 id="org555bbb1">tilde-mode</h3>
<div class="outline-text-3" id="text-org555bbb1">
<p>
Using this mode to "focus" / "unfocus" with the <a href="https://heyfocus.com/">Focus</a> app for MacOS.<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:tilde-mode</span>
[<span class="org-clojure-keyword">:f</span> [<span class="org-clojure-keyword">:openhide</span> <span class="org-string">"focus://focus?minutes=60"</span>]]
[<span class="org-clojure-keyword">:t</span> [<span class="org-clojure-keyword">:openhide</span> <span class="org-string">"focus://toggle"</span>]]
[<span class="org-clojure-keyword">:u</span> [<span class="org-clojure-keyword">:openhide</span> <span class="org-string">"focus://unfocus"</span>]]
[<span class="org-clojure-keyword">:comma</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"focus://preferences"</span>]]
</pre>
</div>
</div>
</div>
