html/karabiner.html
<div id="outline-container-orgf776abe" class="outline-3">
<h3 id="orgf776abe">comma-mode</h3>
<div class="outline-text-3" id="text-orgf776abe">
<p>
Just some like random stuff. Open notes, zoom links, twitter, typing tests.<br />
</p>

<p>
Open <a href="https://chrome.google.com/webstore/detail/history-trends-unlimited/pnmchffiealhkdloeffcdnbgdnedheme?hl=en">History Trends Unlimited</a> chrome extension<br />
</p>
<div class="org-src-container">
<pre class="src src-apples"><span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Google Chrome"</span> <span class="org-apples-reserved-words">to</span> <span class="org-apples-commands">open location</span> <span class="org-string">"chrome-extension://pnmchffiealhkdloeffcdnbgdnedheme/search.html"</span>
</pre>
</div>

<p>
Open a URL, but only if it's not already a tab. If it's a tab, then go to that tab.<br />
</p>
<div class="org-src-container">
<pre class="src src-apples"><span class="org-apples-statements">on</span> <span class="org-function-name">run</span> (clp)
    <span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Safari"</span>
        <span class="org-apples-statements">repeat with</span> w <span class="org-apples-reserved-words">in</span> windows
            <span class="org-apples-commands">set</span> <span class="org-variable-name">i</span> <span class="org-apples-reserved-words">to</span> 1
            <span class="org-apples-statements">repeat with</span> t <span class="org-apples-reserved-words">in</span> tabs <span class="org-apples-reserved-words">of</span> w
                <span class="org-apples-statements">if</span> URL <span class="org-apples-reserved-words">of</span> t <span class="org-apples-operators">starts with</span> clp<span class="org-apples-reserved-words">'s</span> item 1 <span class="org-apples-statements">then</span>
                    <span class="org-apples-commands">set</span> current tab <span class="org-apples-reserved-words">of</span> w <span class="org-apples-reserved-words">to</span> t
                    <span class="org-comment-delimiter">-- </span><span class="org-comment">set active tab index of w to i</span>
                    <span class="org-apples-statements">tell</span> w
                        <span class="org-apples-commands">set</span> <span class="org-variable-name">index</span> <span class="org-apples-reserved-words">to</span> 1
                    <span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
                    <span class="org-comment-delimiter">-- </span><span class="org-comment">delay 0.05</span>
                    <span class="org-comment-delimiter">-- </span><span class="org-comment">do shell script "open -a Safari"</span>
                    <span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"System Events"</span>
                        perform action <span class="org-string">"AXRaise"</span> <span class="org-apples-reserved-words">of</span> <span class="org-apples-reserved-words">front</span> window <span class="org-apples-reserved-words">of</span> <span class="org-apples-statements">application</span> process <span class="org-string">"Safari"</span>
                    <span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
                    <span class="org-apples-commands">activate</span>
                    <span class="org-apples-statements">return</span>
                <span class="org-apples-statements">end</span> <span class="org-apples-statements">if</span>
                <span class="org-apples-commands">set</span> <span class="org-variable-name">i</span> <span class="org-apples-reserved-words">to</span> i<span class="org-apples-operators"> + </span>1
            <span class="org-apples-statements">end</span> <span class="org-apples-statements">repeat</span>
        <span class="org-apples-statements">end</span> <span class="org-apples-statements">repeat</span>
        <span class="org-apples-commands">open location</span> clp<span class="org-apples-reserved-words">'s</span> item 1
        <span class="org-apples-commands">activate</span>
    <span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
<span class="org-apples-statements">end</span> <span class="org-apples-commands">run</span>
</pre>
</div>

<p>
Check my calendar; if there's an event with a zoom link, open the zoom link.<br />
</p>
<div class="org-src-container">
<pre class="src src-apples">use <span class="org-apples-reserved-words">script</span> <span class="org-string">"CalendarLib EC"</span> version <span class="org-string">"1.1.5"</span>
use <span class="org-apples-standard-folders">scripting additions</span>
use framework <span class="org-string">"Foundation"</span>

<span class="org-apples-reserved-words">property</span> NSRegularExpressionCaseInsensitive : <span class="org-apples-operators">a reference to</span> 1
<span class="org-apples-reserved-words">property</span> NSRegularExpression : <span class="org-apples-operators">a reference to</span> current <span class="org-apples-statements">application</span><span class="org-apples-reserved-words">'s</span> NSRegularExpression

<span class="org-comment-delimiter">-- </span><span class="org-comment">fetch properties of events for next week</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">now</span> <span class="org-apples-reserved-words">to</span> <span class="org-apples-commands">current date</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">theStore</span> <span class="org-apples-reserved-words">to</span> fetch store
<span class="org-apples-commands">set</span> <span class="org-variable-name">theCal</span> <span class="org-apples-reserved-words">to</span> fetch calendar <span class="org-string">"Calendar"</span> cal type cal exchange event store theStore <span class="org-comment-delimiter">-- </span><span class="org-comment">change to suit</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">theEvents</span> <span class="org-apples-reserved-words">to</span> fetch events starting date now ending date now searching cals {theCal} event store theStore <span class="org-comment-delimiter">-- </span><span class="org-comment">get events that are occurring currently</span>
<span class="org-apples-statements">if</span> length <span class="org-apples-reserved-words">of</span> theEvents <span class="org-apples-reserved-words">is</span> 0
    display notification <span class="org-string">"No events currently!"</span>
    <span class="org-apples-statements">return</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">if</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">theEvent</span> <span class="org-apples-reserved-words">to</span> (item 1 <span class="org-apples-reserved-words">of</span> theEvents)
<span class="org-apples-commands">set</span> <span class="org-variable-name">theEventRecord</span> <span class="org-apples-reserved-words">to</span> event <span class="org-apples-commands">info for</span> event theEvent
<span class="org-apples-commands">set</span> <span class="org-variable-name">theEventNotes</span> <span class="org-apples-reserved-words">to</span> (<span class="org-apples-commands">get</span> event_description <span class="org-apples-reserved-words">of</span> theEventRecord)
<span class="org-apples-statements">if</span> theEventNotes <span class="org-apples-reserved-words">is</span> missing value
    display notification <span class="org-string">"Couldn't find the zoom link. Opening calendar..."</span>
    <span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Calendar"</span> <span class="org-apples-reserved-words">to</span> <span class="org-apples-commands">activate</span>
    <span class="org-apples-statements">return</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">if</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">theNSStringSample</span> <span class="org-apples-reserved-words">to</span> current <span class="org-apples-statements">application</span><span class="org-apples-reserved-words">'s</span> NSString<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">stringWithString:</span>theEventNotes
<span class="org-apples-commands">set</span> <span class="org-variable-name">passcodePattern</span> <span class="org-apples-reserved-words">to</span> <span class="org-string">"Password:(?:\\s|\\n)+(\\d{6})"</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">thePasscodeRegEx</span> <span class="org-apples-reserved-words">to</span> NSRegularExpression<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">regularExpressionWithPattern:</span>passcodePattern <span class="org-apples-records">options:</span>NSRegularExpressionCaseInsensitive <span class="org-apples-records">|error|:</span>(missing value)
<span class="org-apples-commands">set</span> <span class="org-variable-name">aMatch</span> <span class="org-apples-reserved-words">to</span> thePasscodeRegEx<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">firstMatchInString:</span>theNSStringSample <span class="org-apples-records">options:</span>0 <span class="org-apples-records">range:</span>[0, theNSStringSample<span class="org-apples-reserved-words">'s</span> |length|]
<span class="org-apples-statements">if</span> aMatch <span class="org-apples-operators">is not</span> missing value <span class="org-apples-statements">then</span>
    <span class="org-apples-commands">set</span> <span class="org-variable-name">partRange</span> <span class="org-apples-reserved-words">to</span> (aMatch<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">rangeAtIndex:</span>1) <span class="org-apples-operators">as</span> record
    <span class="org-apples-commands">set</span> <span class="org-variable-name">passcode</span> <span class="org-apples-reserved-words">to</span> (theNSStringSample<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">substringWithRange:</span>partRange) <span class="org-apples-operators">as</span> text
    <span class="org-apples-commands">set the clipboard to</span> passcode <span class="org-comment-delimiter">-- </span><span class="org-comment">copy the passcode in case zoom prompts for it</span>
<span class="org-apples-statements">else</span>
    display notification <span class="org-string">"Couldn't find the passcode."</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">if</span>

<span class="org-apples-commands">set</span> <span class="org-variable-name">zoomLinkPattern</span> <span class="org-apples-reserved-words">to</span> <span class="org-string">"https:\\/\\/(?:.+\\.)?zoom\\.us\\/j\\/(\\d+)\\?pwd=([a-zA-Z0-9]+)"</span>
<span class="org-apples-commands">set</span> <span class="org-variable-name">theZoomLinkRegEx</span> <span class="org-apples-reserved-words">to</span> NSRegularExpression<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">regularExpressionWithPattern:</span>zoomLinkPattern <span class="org-apples-records">options:</span>NSRegularExpressionCaseInsensitive <span class="org-apples-records">|error|:</span>(missing value)
<span class="org-apples-commands">set</span> <span class="org-variable-name">aMatch</span> <span class="org-apples-reserved-words">to</span> theZoomLinkRegEx<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">firstMatchInString:</span>theNSStringSample <span class="org-apples-records">options:</span>0 <span class="org-apples-records">range:</span>[0, theNSStringSample<span class="org-apples-reserved-words">'s</span> |length|]
<span class="org-apples-statements">if</span> aMatch <span class="org-apples-operators">is not</span> missing value <span class="org-apples-statements">then</span>
    <span class="org-apples-commands">set</span> <span class="org-variable-name">partRange</span> <span class="org-apples-reserved-words">to</span> (aMatch<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">rangeAtIndex:</span>1) <span class="org-apples-operators">as</span> record
    <span class="org-apples-commands">set</span> <span class="org-variable-name">zoomConfNo</span> <span class="org-apples-reserved-words">to</span> (theNSStringSample<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">substringWithRange:</span>partRange) <span class="org-apples-operators">as</span> text
    <span class="org-apples-commands">set</span> <span class="org-variable-name">partRange</span> <span class="org-apples-reserved-words">to</span> (aMatch<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">rangeAtIndex:</span>2) <span class="org-apples-operators">as</span> record
    <span class="org-apples-commands">set</span> <span class="org-variable-name">zoomPwd</span> <span class="org-apples-reserved-words">to</span> (theNSStringSample<span class="org-apples-reserved-words">'s</span> <span class="org-apples-records">substringWithRange:</span>partRange) <span class="org-apples-operators">as</span> text
    display notification <span class="org-string">"Starting zoom..."</span>
    <span class="org-apples-commands">open location</span> <span class="org-string">"zoommtg://zoom.us/join?confno="</span><span class="org-apples-operators"> &amp; </span>zoomConfno<span class="org-apples-operators"> &amp; </span><span class="org-string">"&amp;pwd="</span><span class="org-apples-operators"> &amp; </span>zoomPwd
<span class="org-apples-statements">else</span>
    display notification <span class="org-string">"Couldn't find the zoom link. Opening calendar..."</span>
    <span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Calendar"</span> <span class="org-apples-reserved-words">to</span> <span class="org-apples-commands">activate</span>
<span class="org-apples-statements">end</span> <span class="org-apples-statements">if</span>
</pre>
</div>

<p>
I really like Safari, but sometimes need to use Chrome for various extensions etc. Solution: have Safari =&gt; Chrome shortcut.<br />
</p>
<div class="org-src-container">
<pre class="src src-apples"><span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Safari"</span>
    <span class="org-apples-commands">set</span> <span class="org-variable-name">theURL</span> <span class="org-apples-reserved-words">to</span> URL <span class="org-apples-reserved-words">of</span> current tab <span class="org-apples-reserved-words">of</span> window 1
    <span class="org-apples-statements">tell</span> <span class="org-apples-statements">application</span> <span class="org-string">"Google Chrome"</span> <span class="org-apples-reserved-words">to</span> <span class="org-apples-commands">open location</span> theURL
<span class="org-apples-statements">end</span> <span class="org-apples-statements">tell</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-clojure"><span class="org-clojure-keyword">:comma-mode</span>
[:1 [<span class="org-clojure-keyword">:withsecretsmarturl</span> <span class="org-string">"$PSYCH_LECTURE_LINK"</span>]]
[:3 [<span class="org-clojure-keyword">:withsecret</span> <span class="org-string">"open $PAC_PROJECT_ZOOM_LINK"</span>]]
<span class="org-comment-delimiter">;; </span><span class="org-comment">add title bar to frame</span>
[<span class="org-clojure-keyword">:a</span> [<span class="org-clojure-keyword">:elisp</span> <span class="org-string">"(setq mac-use-title-bar t)(setq ketan0/old-frame (selected-frame)) (make-frame)(delete-frame ketan0/old-frame)"</span>]]
[<span class="org-clojure-keyword">:b</span> <span class="org-string">"osascript ~/.dotfiles/open_in_chrome.scpt"</span>]
[<span class="org-clojure-keyword">:c</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"/Users/ketanagrawal/org_private/capture.org"</span>]]
[<span class="org-clojure-keyword">:d</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"https://drive.google.com/drive/my-drive"</span>]]
[<span class="org-clojure-keyword">:o</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"http://doc.new"</span>]] <span class="org-comment-delimiter">;; </span><span class="org-comment">new google doc</span>
[<span class="org-clojure-keyword">:e</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"/Users/ketanagrawal/.dotfiles/doom.d/config.el"</span>]]
[<span class="org-clojure-keyword">:f</span> [<span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"https://www.keyhero.com/free-typing-test/"</span>]]
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:h [:km "Github =&gt; Emacs"]]</span>
[<span class="org-clojure-keyword">:h</span> <span class="org-string">"osascript /Users/ketanagrawal/.dotfiles/open_chrome_history.scpt"</span>]

[<span class="org-clojure-keyword">:i</span> [<span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"https://www.keyhero.com/typing-instant-death/"</span>]]
[<span class="org-clojure-keyword">:j</span> [<span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"http://localhost:8888"</span>]]
[<span class="org-clojure-keyword">:l</span> <span class="org-string">"osascript /Users/ketanagrawal/.dotfiles/open_current_zoom_link.scpt"</span>]
[<span class="org-clojure-keyword">:m</span> [<span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"https://outlook.office.com/"</span>]]
[<span class="org-clojure-keyword">:n</span> [<span class="org-clojure-keyword">:openwith</span> <span class="org-string">"Google Chrome"</span> <span class="org-string">"https://www.netflix.com/title/80199128"</span>]]
[<span class="org-clojure-keyword">:p</span> [<span class="org-clojure-keyword">:withsecretsmarturl</span> <span class="org-string">"$PAC_PROGRESS_DOC_LINK"</span>]]
[<span class="org-clojure-keyword">:t</span> [<span class="org-clojure-keyword">:smarturl</span> <span class="org-string">"https://twitter.com/i/bookmarks"</span>]]
[<span class="org-clojure-keyword">:r</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"/Users/ketanagrawal/org_private/todos.org"</span>]]
[<span class="org-clojure-keyword">:s</span> [<span class="org-clojure-keyword">:open</span> <span class="org-string">"/Users/ketanagrawal/.dotfiles/karabiner.org"</span>]]
<span class="org-comment-delimiter">;; </span><span class="org-comment">[:v [:open "https://healthy.verily.com/"]] ;; covid testing</span>
[<span class="org-clojure-keyword">:v</span> [<span class="org-clojure-keyword">:openwith</span> <span class="org-string">"Emacs"</span> <span class="org-string">"/Users/ketanagrawal/Dropbox/Apps/GoodNotes 5/GoodNotes/vision.pdf"</span>]]
[<span class="org-clojure-keyword">:y</span> [<span class="org-clojure-keyword">:openwith</span> <span class="org-string">"Emacs"</span> <span class="org-string">"/Users/ketanagrawal/.dotfiles/yabairc"</span>]]
[<span class="org-clojure-keyword">:z</span> [<span class="org-clojure-keyword">:withsecret</span> <span class="org-string">"open $MY_ZOOM_LINK"</span>]]
</pre>
</div>
</div>
</div>
